cf/DataProcessors/AIFillProductDefinitions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AIFillProductDefinitions</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Promt</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AIPromtTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Catalogs/AIPromtTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AIPromtTemplates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>PromtText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefinitionLength</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/DataProcessors/AIFillProductDefinitions/Forms/Form/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
    
    If  NOT ValueIsFilled(Catalogs.AIPromtTemplates.Default.PromtText) Then 
        Item = Catalogs.AIPromtTemplates.Default.GetObject(); 
        Item.PromtText =  "Describe the main product parameters for customers." ; 
        Item.DefinitionLength = 200;
        Item.Write();
    EndIf;    
    Object.Promt =  Catalogs.AIPromtTemplates.Default; 
    
EndProcedure

&AtClient
Procedure GenerateDescription(Command)
    GenerateDescriptionAtServer();
EndProcedure

&AtServer 
Procedure GenerateDescriptionAtServer()
    If Not ValueIsFilled(Object.Product) Then
        Common.MessageToUser(NSTR("en = 'Please first pick a product'; tr = 'Lütfen önce ürün seçiniz.'"));
        Return;
    EndIf;
    
    ProductName = Object.Product.Description;
    PromptText  = Strtemplate("Create description for Product name %1 with length %2 symbols and using rules %3",ProductName,Object.Promt.DefinitionLength , Object.Promt.PromtText); 
    
    Result = GroqAi.SendToAi(PromptText);
    
    If Result <> Undefined Then
        Object.Definition = Result;
    EndIf;
EndProcedure                         


&AtClient
Procedure ApplyToProduct(Command)
    If Not ValueIsFilled(object.Definition)Then
        ShowMessageBox(, NSTR("en = 'First create a definition.'; tr = 'Önce bir tanım oluşturun.'"));
        return;
    EndIf;
    
    QuestionText = NSTR("en = 'This description will be written on the product and will overwrite the existing description. Are you sure?'; tr = 'Bu açıklama mevcut açıklamanın üzerine yazılacak. Emin misiniz?'");
    ShowQueryBox(New NotifyDescription("ApplyToProductConfirmed", ThisObject), QuestionText, QuestionDialogMode.YesNo);
    
EndProcedure  

&AtClientProcedure ApplyToProductConfirmed(Response, AdditionalParameters) Export        If Response = DialogReturnCode.Yes Then        ApplyToProductAtServer();    EndIf;    EndProcedure

&AtServerProcedure ApplyToProductAtServer()        ProductObject = Object.Product.GetObject(); 
    ProductObject.DetailedDescription = Object.Definition;
    ProductObject.Write();  
    
    Common.MessageToUser(NSTR("en = 'Description has been transferred to the product: '; tr = 'Açıklama ürüne aktarıldı: '") + Common.ObjectAttributeValue(Object.Product, "Description"));
    
EndProcedure
